app/controllers/pictures_controller.rb

  def index
    last_month = DateTime.current.prev_month
    @most_recent_pictures = Picture.most_recent_five
    @old_pictures = Picture.created_before(last_month)
    @jin_nian_pictures = Picture.pictures_created_in_year(Time.new.year)
    @pictures = Picture.all
---
SELECT "pictures".* FROM "pictures" WHERE ("pictures"."created_at" BETWEEN ? AND ?)  [["created_at", 2017-01-01 05:00:00 UTC], ["created_at", 2018-01-01 05:00:00 UTC]]

  def create
    @picture = Picture.new

    @picture.title = params[:picture][:title]
    @picture.artist = params[:picture][:artist]
    @picture.url = params[:picture][:url]

    if @picture.save
---
INSERT INTO "pictures" ("artist", "title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["artist", "Catcat"], ["title", "Bur"], ["url", ""], ["created_at", 2017-11-21 23:11:28 UTC], ["updated_at", 2017-11-21 23:11:28 UTC]]

  def update
    @picture = Picture.find(params[:id])

    @picture.title = params[:picture][:title]
    @picture.artist = params[:picture][:artist]
    @picture.url = params[:picture][:url]

    if @picture.save
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "pictures" SET "artist" = ?, "updated_at" = ? WHERE "pictures"."id" = ?  [["artist", "Yo Ho Ho"], ["updated_at", 2017-12-09 23:06:02 UTC], ["id", 8]]

  def destroy
    @picture = Picture.find(params[:id])
    @picture.destroy
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 5]]